In [3]:
# Importamos pandas y numpy

import pandas as pd
import numpy as np

# Reto 1

Mediante la creación de una lista de tuplas y otra de Strings, crea un
Dataframe de como mínimo 5 columnas y 5 filas.

In [7]:
# Definición de las listas de tuplas y strings

t1 = ("BMW", 10, "Alemania", 250, "Deportivo")
t2 = ("Fiat", 17, "Italia", 210, "Turismo")
t3 = ("Ferrari", 1, "Italia", 310, "Lujo")
t4 = ("Porsche", 2, "Alemania", 330 , "Lujo")
t5 = ("Kia", 14, "Corea", 210, "Turismo")
lista_coches = [t1, t2, t3,t4, t5]
columnas1 = ("Marca", "Seg", "Pais", "Vel. Max.", "Tipo")

# Creación del DataFrame

cs = pd.DataFrame(lista_coches, columns=columnas1)

# Imprimir el DataFrame

cs

     Marca  Seg      Pais  Vel. Max.       Tipo
0      BMW   10  Alemania        250  Deportivo
1     Fiat   17    Italia        210    Turismo
2  Ferrari    1    Italia        310       Lujo
3  Porsche    2  Alemania        330       Lujo
4      Kia   14     Corea        210    Turismo

# Reto 2
Mediante la creación de una lista de diccionarios, crea el mismo
dataframe anterior pero, esta vez, haz que las columnas aparezcan
en distinto orden y que, al menos 2 de las filas no contengan datos.

In [10]:
# Definición de la lista de diccionarios

t1 = {"Marca": "BMW", "Seg": 10, "Vel. Max.": 250, "Pais": "Alemania", "Tipo": "Deportivo"}
t2 = {"Marca":"Fiat","Seg":  17, "Vel. Max.": 210, "Pais": "Italia",  "Tipo": "Turismo"}
t3 = {"Marca":"Ferrari", "Seg": 1, "Vel. Max.": 310, "Pais": "Italia",  "Tipo": "Lujo"}
t4 = {"Marca":"Porsche", "Seg": 2, "Vel. Max.": 330, "Pais": "Alemania",  "Tipo": "Lujo"}
t5 = {"Marca":"Kia", "Seg": 14, "Vel. Max.": 210, "Pais": "Corea",  "Tipo": "Turismo"}
lista_coches2 = [t1, t2, "", t3,t4, "", t5]
columnas2 = ("Marca", "Seg", "Vel. Max.", "Pais", "Tipo")

# Definición de los nombres de las columnas

# Creación del DataFrame

ch = pd.DataFrame(lista_coches2, columns=columnas2)

# Imprimir el DataFrame

ch

     Marca   Seg  Vel. Max.      Pais       Tipo
0      BMW  10.0      250.0  Alemania  Deportivo
1     Fiat  17.0      210.0    Italia    Turismo
2      NaN   NaN        NaN       NaN        NaN
3  Ferrari   1.0      310.0    Italia       Lujo
4  Porsche   2.0      330.0  Alemania       Lujo
5      NaN   NaN        NaN       NaN        NaN
6      Kia  14.0      210.0     Corea    Turismo

# Reto 3

Crea un archivo CSV mediante el bloc de notas. Este archivo debe
representar la compra efectuada por 5 personas distintas en una
carnicería que solo dispone de 6 tipos de carne. Utiliza como
separadores de columna un símbolo distinto a la coma.

# Reto 4

Importa el archivo creado en el RETO 3 mediante Pandas para crear un
dataframe. Se mostrará por consola al ser finalizado.

In [14]:
compras_total = pd.read_csv("compras.csv", sep=';')
compras_total

      Nombre  Carne 1  Carne 2  Carne 3  Carne 4  Carne 5  Carne 6
0       Pepe        3        2        0        2        3        3
1      Sonia        3        3        3        2        2        2
2  Francisca        0        2        2        4        4        3
3     Hector        1        2        4        0        1        3
4     Felipe        2        1        3        1        3        0